cask_args appdir: "/Applications"

## commands
brew "git"
brew "gh"
brew "ghq"
brew "zsh"
brew "jq"
brew "tldr"
brew "peco"
brew "docker"
brew "ssh-copy-id"
brew "bat"
brew "mas"
brew "thefuck"
brew "lastpass-cli"
brew "httpie"

# brew "spark"
# brew "mycli"

## kubernetes
brew "kubectx"
tap "johanhaleby/kubetail"
brew "kubetail"
tap "superbrothers/zsh-kubectl-prompt"
brew "zsh-kubectl-prompt"

## languages
# brew "go"
# brew "grpc"
# brew "php"

## Applications
cask 'authy'
cask 'iterm2'
cask 'slack'
cask 'alfred'
cask 'station'
cask 'spectacle'
cask 'dropbox'
cask 'google-chrome'
cask 'google-japanese-ime'

## Development Applications
cask 'docker'
cask 'homebrew/cask-versions/sequel-pro-nightly'
cask 'visual-studio-code'
qq
# cask 'onedrive'
# cask 'google-cloud-sdk'
# cask 'bettertouchtool'
# cask 'intellij-idea'
# cask 'mockoon'
