cask_args appdir: "/Applications"

## commands
brew "git"
brew "k1LoW/tap/git-wt"
brew "gh"
brew "ghq"
brew "gpg"
brew "zsh"
brew "jq"
brew "ssh-copy-id"
brew "bat"
brew "httpie"
brew "zsh-completions"
brew "tree"
brew "mise"
brew "aqua"
brew "zoxide"
brew "fzf"
brew "ni"

## Utilities
brew "tldr"
brew "duti" # for set default applications

# brew "thefuck"
# brew "yamllint"
# brew "spark"
# brew "mycli"

## kubernetes
# brew "kubectx"
# tap "johanhaleby/kubetail"
# brew "kubetail"
# tap "superbrothers/zsh-kubectl-prompt"
# brew "derailed/k9s/k9s"
# brew "zsh-kubectl-prompt"

## languages
# brew "go"
# brew "grpc"
# brew "php"

## Applications
cask 'aerospace'
cask 'iterm2'
cask 'slack'
cask 'alfred'
cask 'dropbox'
cask 'google-chrome'
cask 'google-japanese-ime'

## Development Applications
cask 'docker'
cask 'visual-studio-code'

# cask 'dash'
# cask 'bettertouchtool'
# cask 'sequel-ace'
# cask 'pgadmin4'
# cask 'mongodb-compass'

# cask 'station'
# cask 'notion'
# cask 'keycastr'
# cask 'onedrive'
# cask 'google-cloud-sdk'
# cask 'intellij-idea'
# cast 'ngrok'
# cask 'mockoon'
