cask_args appdir: "/Applications"

## commands
brew "git"
brew "zsh"
brew "jq"
brew "peco"
brew "docker"
brew "ssh-copy-id"
brew "mas"
brew "kubectx"
brew "kubetail"
tap "johanhaleby/kubetail"
brew "kubetail"
tap "superbrothers/zsh-kubectl-prompt"
brew "zsh-kubectl-prompt"

# brew "spark"
# brew "tldr"
# brew "httpie"
# brew "mycli"

## languages
# brew "go"
# brew "dep"
# brew "php"

## Applications
cask 'iterm2'
cask 'authy'
cask 'slack'
cask 'alfred'
cask 'docker'
cask 'sequel-pro'
cask 'spectacle'
cask 'onedrive'
cask 'bettertouchtool'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'google-cloud-sdk'
